## 了解加工摩拜单车数据集

In [2]:
import pandas as pd
import numpy as np

In [4]:
docAddress = r"D:\Github\Visualization-with-Tableau\Mobike Data\mobike_shanghai_sample_updated.csv"
df = pd.read_csv(docAddress)

,orderid,bikeid,userid,start_time,start_location_x,start_location_y,end_time,end_location_x,end_location_y,track
0,78387,158357,10080,2016-08-20 06:57,121.348,31.389,2016-08-20 07:04,121.357,31.388,"121.347,31.392#121.348,31.389#121.349,31.390#1..."
1,891333,92776,6605,2016-08-29 19:09,121.508,31.279,2016-08-29 19:31,121.489,31.271,"121.489,31.270#121.489,31.271#121.490,31.270#1..."
2,1106623,152045,8876,2016-08-13 16:17,121.383,31.254,2016-08-13 16:36,121.405,31.248,"121.381,31.251#121.382,31.251#121.382,31.252#1..."
3,1389484,196259,10648,2016-08-23 21:34,121.484,31.320,2016-08-23 21:43,121.471,31.325,"121.471,31.325#121.472,31.325#121.473,31.324#1..."
4,188537,78208,11735,2016-08-16 07:32,121.407,31.292,2016-08-16 07:41,121.418,31.288,"121.407,31.291#121.407,31.292#121.408,31.291#1..."

In [6]:
df.head()

,orderid,bikeid,userid,start_time,start_location_x,start_location_y,end_time,end_location_x,end_location_y,track
0,78387,158357,10080,2016-08-20 06:57,121.348,31.389,2016-08-20 07:04,121.357,31.388,"121.347,31.392#121.348,31.389#121.349,31.390#1..."
1,891333,92776,6605,2016-08-29 19:09,121.508,31.279,2016-08-29 19:31,121.489,31.271,"121.489,31.270#121.489,31.271#121.490,31.270#1..."
2,1106623,152045,8876,2016-08-13 16:17,121.383,31.254,2016-08-13 16:36,121.405,31.248,"121.381,31.251#121.382,31.251#121.382,31.252#1..."
3,1389484,196259,10648,2016-08-23 21:34,121.484,31.320,2016-08-23 21:43,121.471,31.325,"121.471,31.325#121.472,31.325#121.473,31.324#1..."
4,188537,78208,11735,2016-08-16 07:32,121.407,31.292,2016-08-16 07:41,121.418,31.288,"121.407,31.291#121.407,31.292#121.408,31.291#1..."

In [7]:
df.shape

(102361, 10)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102361 entries, 0 to 102360
Data columns (total 10 columns):
orderid             102361 non-null int64
bikeid              102361 non-null int64
userid              102361 non-null int64
start_time          102361 non-null object
start_location_x    102361 non-null float64
start_location_y    102361 non-null float64
end_time            102361 non-null object
end_location_x      102361 non-null float64
end_location_y      102361 non-null float64
track               102361 non-null object
dtypes: float64(4), int64(3), object(3)
memory usage: 7.8+ MB

In [12]:
df.describe()

,orderid,bikeid,userid,start_location_x,start_location_y,end_location_x,end_location_y
count,1.023610e+05,102361.000000,102361.000000,102361.000000,102361.000000,102361.000000,102361.000000
mean,8.940838e+05,155425.868690,7834.435644,121.454144,31.251740,121.453736,31.252029
std,5.219651e+05,98816.625402,4530.387938,0.060862,0.057358,0.061577,0.057740
min,6.000000e+00,3.000000,1.000000,121.173000,30.842000,120.486000,30.841000
25%,4.386790e+05,74701.000000,4095.000000,121.415000,31.212000,121.414000,31.212000
50%,8.901510e+05,141990.000000,7617.000000,121.456000,31.260000,121.456000,31.261000
75%,1.343252e+06,228303.000000,11278.000000,121.497000,31.294000,121.497000,31.294000
max,1.807864e+06,387351.000000,17753.000000,121.970000,31.450000,121.971000,31.477000

In [13]:
#检查重复数据
sum(df.duplicated())

0

摩拜单车数据集包含102361条数据，10个变量。无缺失值和重复数据，是个比较干净的数据集。

In [14]:
df.nunique()

orderid             102361
bikeid               79062
userid               16887
start_time           30833
start_location_x       471
start_location_y       430
end_time             31297
end_location_x         479
end_location_y         440
track               100117
dtype: int64

- 102361个订单中有100117个不重复轨迹，2244个重复轨迹是哪些？
- 重复轨迹的起始点是否有足够多的单车供使用？

In [33]:
df_new = df.copy()

In [34]:
#新建一列统计轨迹点的个数
df_new['spots'] = df['track'].str.count('#') + 1

In [35]:
df_new.spots.value_counts()

11     4289
12     4256
10     4123
13     4008
14     3995
9      3924
15     3864
8      3679
16     3504
17     3260
7      3213
18     3080
6      2961
19     2868
20     2613
5      2560
21     2433
22     2155
4      2083
23     2070
24     1985
2      1877
3      1813
25     1678
26     1661
27     1523
28     1409
29     1363
30     1258
31     1178
       ...
258       1
194       1
202       1
370       1
244       1
257       1
308       1
185       1
252       1
254       1
235       1
292       1
232       1
231       1
203       1
269       1
200       1
276       1
277       1
216       1
326       1
262       1
198       1
223       1
479       1
224       1
228       1
265       1
229       1
221       1
Name: spots, Length: 241, dtype: int64

In [36]:
df_new.spots.sort_values()

85347       2
95166       2
10600       2
73562       2
95170       2
82925       2
17568       2
23047       2
69593       2
60987       2
6572        2
1253        2
19739       2
35204       2
98993       2
28879       2
23516       2
17575       2
65298       2
17585       2
41461       2
10623       2
55158       2
17586       2
25397       2
76309       2
26298       2
35211       2
85530       2
98036       2
         ...
41638     223
15556     224
48234     228
16368     229
72455     231
13235     232
27635     234
40683     234
36102     235
60293     239
29113     243
59010     243
75444     244
52904     246
39081     246
58483     252
11343     254
42231     257
81111     258
91255     262
53375     265
100946    269
23351     276
35232     277
8964      292
62435     306
65610     308
81338     326
5954      370
101327    479
Name: spots, Length: 102361, dtype: int64

- 路径点只有2个的订单有多少？
- 路径点少是因为车坏了，还是因为解决的是最后一公里的问题？
- 路径点的数量跟骑行时间的关系是？

In [37]:
df_new.head()

,orderid,bikeid,userid,start_time,start_location_x,start_location_y,end_time,end_location_x,end_location_y,track,spots
0,78387,158357,10080,2016-08-20 06:57,121.348,31.389,2016-08-20 07:04,121.357,31.388,"121.347,31.392#121.348,31.389#121.349,31.390#1...",16
1,891333,92776,6605,2016-08-29 19:09,121.508,31.279,2016-08-29 19:31,121.489,31.271,"121.489,31.270#121.489,31.271#121.490,31.270#1...",36
2,1106623,152045,8876,2016-08-13 16:17,121.383,31.254,2016-08-13 16:36,121.405,31.248,"121.381,31.251#121.382,31.251#121.382,31.252#1...",41
3,1389484,196259,10648,2016-08-23 21:34,121.484,31.320,2016-08-23 21:43,121.471,31.325,"121.471,31.325#121.472,31.325#121.473,31.324#1...",18
4,188537,78208,11735,2016-08-16 07:32,121.407,31.292,2016-08-16 07:41,121.418,31.288,"121.407,31.291#121.407,31.292#121.408,31.291#1...",8

In [38]:
df_new.iloc[4, 9:11]

track    121.407,31.291#121.407,31.292#121.408,31.291#1...
spots                                                    8
Name: 4, dtype: object

In [39]:
df_new.iloc[10600, 9:11]

track    121.337,31.151#121.340,31.150
spots                                2
Name: 10600, dtype: object

In [40]:
path = r"D:\Github\Visualization-with-Tableau\Mobike Data\mobike_shanghai_sample_processed.csv"
df_new.to_csv(path)